documents/dev-previews.org
#+ TITLE: 管家项目概要设计文档
#+ STARTUP: indent

* 项目概述

* 平台用户角色
** 末端用户
** 维修团队负责人
** 维修团队工作人员
** 周边商家负责人
** 平台运营者

* 系统组成
** 微信公众号

** 管家Android客户端
   + 初步计划使用H5打包工具打包封装成Android客户端发布
     HBuilder工具研究（打包部分）

** 管家IOS客户端
   + 初步计划使用H5打包工具打包封装成IOS客户端发布
     HBuilder工具研究（打包部分）

* 需求说明及概要设计
** M01 微信公众号
*** M01U001 微信公众号菜单
**** 管家服务
***** 家庭维修预约
***** 上门洗车预约
***** 直饮水配送
***** 新鲜蔬果配送
***** 更多......

**** 会员中心
***** 全年免费项目 
***** 服务预约查询 
***** 个人信息中心 

**** 商务合作
***** 维修团队加盟 
***** 周边商家加盟
***** 了解管家

*** M01U002 微信公众号欢迎词
    + 新关注用户首次进入后推送
    + 计划使用单图文页
    + 欢迎词标题：
      #+begin_src c -t -h 7 -w 40
      欢迎使用便民管家服务！
      只需100元，52种家庭维修项目，全年无限次数，免费上门服务！
      #+end_src

** M02 微信H5网站
*** SITEMAP
     #+BEGIN_SRC c -t -h 7 -w 40
     Welcome页
      |--- Splash-1 页  
      |--- Splash-2 页 
      |--- Splash-3 页
     首页
     维修
      |--- 引导加入会员页
      |--- 维修预约主页
           |--- 预约附加信息页
           |--- 预约工单展示页       
     洗车
      |--- 洗车预约主页
           |--- 洗车工单支付页
           |--- 洗车工单详情页
     商城
      |--- 商家服务分类主页
      |--- 商家产品列表页
      |--- 周边商家列表页
      |--- 商家产品详情页
      |--- 购物车页
      |--- 订单详情页
      |--- 订单支付页
      |--- 订单评价页
     我的
      |--- 会员中心主页
           |--- 会员信息页
           |--- 会员住址页
                 |--- 新增住址页
                 |--- 住址编辑页
           |--- 我的订单页
           |--- 维修记录页
           |--- 洗车记录页
           |--- 我的钱包页
           |--- 服务条款页
           |--- 常见问题页
     #+END_SRC

*** M02U001 底部导航菜单
**** 首页
**** 维修
     + 如果用户尚未成为会员，点击进入加入会员引导页（M02U003）;
     + 如果用户已经成功为员，点击直接进入维修预约主页(M02U004)；
     + 如果会员当前已经预约维修服务，点击进入维修预约工单详情；
     + 点击底部导航菜单“维修”，如果当前用户尚未成为会员，则进入该页面；
     + 该页面是一个广告页，包括煽动人心的广告及52项会员免费维修服务列表，该页面右下角固定位置始终悬浮一个“加入会员”的按钮；
 
**** 洗车
**** 商城
**** 我的

*** M02U002 Welcome页
    Welcome页作为一个首次登录或使用时的欢迎介绍，在不同终端各自功能不同。

**** 微信端
     + 微信端通过菜单项进入后会有一个初始化获取微信用户数据的过程（如或者用户昵称，OpenId等），同时也需要初始化数据，此时可以显示第一页，等待所有数据初始化完成，再进入后续功能页面；

**** Android或IOS客户端
     + Android或IOS客户端，在APP初次安装时，及版本更新后，需要显示SPASH页（见SITEMAP，具体显示多少个SPASH，根据具体需要展示的广告或新功能介绍而定），使用左右滑动切换，最后一页一个按钮进入首页。
     
*** M02U003 引导加入会员页
     + 点击底部导航菜单“维修”，如果当前用户尚未成为会员，则进入该页面；
     + 该页面是一个广告页，包括煽动人心的广告及52项会员免费维修服务列表，该页面右下角固定位置始终悬浮一个“加入会员”的按钮；
     + 52项会员免费服务项目列表采用平列展示，包括服务名称，服务概述（点击单行，在该下方可折叠显示服务内容概述），市场行情价，以及突出的显示“会员免费”；
     + 需要提供非会员的维修预约功能，即在本页左下角固定位置始终悬浮“试用预约”按钮，点击后同样进入维修预约主页；
     
*** M02U004 维修预约主页
     + 点击底部导航菜单“维修”，如果当前用户已经成为会员，则进入该页面；
     + 该页面是一个广告页，包括煽动人心的广告及52项会员免费维修服务列表，该页面右下角固定位置始终悬浮一个“加入会员”的按钮；
 
** M03 代理商派单系统
** M04 Android客户端
** M05 IOS客户端
